# 1. Вывести сообщение "Hello world!"
# 2. Сложить два числа
# 3. Извлечь квадратный корень из числа
# 4. Вычислить площадь треугольника
# 5. Произвести обмен значениями между переменными
# 6. Функция для получения случайного целого числа в заданном диапазоне
# 7. Функция для преобразования километров в мили
# 8. Функция для преобразования градусов Цельсия в градусы Фаренгейта
# 9. Функция для определения того, каким является число: положительным, отрицательным или нулем
# 10. Функция для определения того, каким является число, четным или нечетным
# 11. Функция для определения того, является ли год високосным
# 12. Функция для определения наибольшего числа
# 13. Функция для определения того, является ли число простым
# 14. Функция для вывода всех простых чисел в заданном диапазоне
# 15. Функция для вычисления факториала числа
# 16. Функция для вывода таблицы умножения для указанного числа
# 17. Функция для вычисления суммы чисел из последовательности Фибоначчи до указанного
# 18. Функция для вычисления суммы натуральных чисел от 1 до указанного
# 19. Функция для вывода чисел в степени 2 от 1 до указанного
# 20. Функция для определения всех чисел, которые делятся на другое число без остатка
# 21. Функция для вычисления наибольшего общего делителя
# 22. Функция для вычисления наименьшего общего кратного
# 23. Функция для определения всех чисел, на которые без остатка делится указанное
# 24. Простой калькулятор
# 25. Функция для преобразования числа в двоичное представление
# 26. Функция для сложения матриц
# 27. Функция для транспонирования матрицы
# 28. Функция для определения того, является ли строка палиндромом
# 29. Функция для удаления лишних символов из строки
# 30. Функция для сортировки слов в алфавитном порядке
# 30. Функция для определения количества гласных в строке
# 31. Функция для рисования пирамиды
# 32. Объединить два словаря (объекта) в один
# 33. Преобразовать вложенный список (массив) в одноуровневый (плоский)
# 34. Копировать список (массив) (сделать его срез)
# 35. Перебрать ключи и значения словаря (объекта)
# 36. Отсортировать словарь (объект) по ключам и значениям
# 37. Определить, является ли список (массив) пустым
# 38. Объединить два списка (массива) в один
# 39. Извлечь подстроку из строки
# 40. Функция для получения случайного элемента массива
# 41. Определить количество вхождений элемента в массиве
# 42. Объединить два списка (массива) в словарь (объект)
# 43. Удалить лишние пробелы из строки с помощью регулярного выражения
# 44. Создать перечисления (enum)
# 45. Функция для определения анаграмм
# 46. "Капитализировать" строку
# 47. Функция для определения всех вариантов строки
# 48. Создание счетчика (таймера)
# 49. Создание вложенной директории
# 50. Получение названий файлов с расширением ".txt"
# 51. Определите, не является ли введенная пользователем с клавиатуры строка пустой.
# Результат проверки в виде True или False выведите на экран
# 52. Написать программу, которая будет делить введенные пользователем два вещественных
# числа и выводить результат на экран, сообщая об ошибке в случае деления на ноль
# 53. Определить, является ли введенное с клавиатуры натуральное число кратным трем.
# Вывести результат на экран
# #1
# print("Hello world!")
# #2
# a = 1+6
# print(a)

# #51
# string = input("Введите строку: ")
# if string == "":
#     print("Строка пустая")
# else:
#     print("Строка не пустая")
# #52
# s = float(input("Введите число: "))
# s2 = float(input("Введите число: "))
# if s==0 or s2==0:
#     print('ошибка')
# rezult = s//s2
# print(rezult)
# #53
# num = 12
# if num % 3 == 0:
#     print('yes')
# else:
#     print('no')







