# def my_func(str):
#     print(str)
# # my_func('привет')
#     return True
#
# rezult = my_func('привет')
# print(rezult)


# Создать функцию calc(a, b, operation). Описание
# входных параметров:
# 1) Первое число
# 2) Второе число
# 3) Действие над ними:
# 1. * Сложить 2. - Вычесть
# з. * УмножИТЬ
# 4. / Разделить 5. В остальных случаях функция должна
# возвращать "Операция не поддерживается".

# a = int(input('введите число'))
# b = int(input('введите число'))
# def my_calc(a, b, operation):
#     if operation == '+':
#         return a+b
#     elif operation == '-':
#         return a-b
#     elif operation == '*':
#         return a*b
#     elif operation == '/':
#         return a/b
#     else:
#         return "Операция не поддерживается"
# print(my_calc(a, b,'+'))
# print(my_calc(30, 15,'-'))
# print(my_calc(a, b,'*'))
# print(my_calc(30, 15,'/'))